import os
import getpass
from datetime import datetime
import platform
import time
import random
import requests

RE = '\033[0m'
BO = '\033[1m'
IT = '\033[3m'
UL = '\033[4m'
IN = '\033[7m'

now = datetime.now()
day = now.strftime('%A')
date = now.day
cTime = now.strftime('%H:%M')

phrases2 = [
	"Сегодня отличный день для новых свершений!",
	"Не забывай улыбаться!",
	"Ты способен на всё, что задумаешь!",
	"Время для нового приключения!"
]
phrases1 = [
	f"Сейчас {IN}{cTime}{RE}, а за окном уже {IN}{date}-е{RE}. Надеюсь, день принесёт только приятные моменты.",
	f"Сегодня уже {IN}{day}{RE}, самое время начать новый проект или завершить начатое.",
	f"Сегодня {IN}{day}{RE}, и пора проверить планы на день. Всё по расписанию?",
	f"Текущая версия ОС: {IN}{platform.version()}{RE}. Всё работает стабильно и без сбоев."
]

def tGreet():
	cHour = now.hour
	if 5 <= cHour < 12:
	        return "Доброе утро"
	elif 12 <= cHour < 18:
		return "Добрый день"
	elif 18 <= cHour < 23:
		return "Добрый вечер"
	else:
		return "Доброй ночи"

print(f"""
                                                               
                           *#++++*#*                           
                       *+++*********+++#                       
                    @+******************+*     *++++++++++++   
                   ***********************+* *#   #*******+#   
                  +**************************    @+******+     
                 +**************************** *+*****+*       
                ************************************+*         
                ********************************++*            
                *****************************++*               
              @*+************************++*@                  
           #+=* #********************++*#  %++                 
        @*+*     ****************++*#   #++***                 
      *+***@  **+**********+++**     *++*****                  
    *+******++********++++*      **+******+@                   
   ++*********++++++*@       **++*******+*                     
    **++++**#*          +++++*******++*@                       
                           #*******                            
                                                               
""")

print(f"╔═{BO}Системная информация{RE}═╗")
print(f"{IN}Процессор:{RE} \t\t{platform.processor()}")
print(f"{IN}Версия ОС:{RE} \t\t{platform.version()}")
print(f"{IN}Время на компьютере:{RE} \t{cTime}")
print("╚══════════════════════╝")

print(f"\n{tGreet()}, {IN}{os.getlogin()}{RE}! {random.choice(phrases1)}")
print(f"✧ {IT}{random.choice(phrases2)}{RE} ✧")
